In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [32, 34, 25]
arr = np.array(my_data)
d = { 'a':32, 'b':34, 'c':25 }

In [3]:
pd.Series(data = my_data)

0    32
1    34
2    25
dtype: int64

In [9]:
pd.Series( index = labels, data = my_data)

a    32
b    34
c    25
dtype: int64

In [6]:
pd.Series(arr,labels)

a    32
b    34
c    25
dtype: int32

In [7]:
pd.Series(d)

a    32
b    34
c    25
dtype: int64

In [8]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [10]:
np.random.seed(101)

In [11]:
df = pd.DataFrame(np.random.randn(5,4), ['a', 'b', 'c', 'd', 'e'], ['W', 'X', 'Y', 'Z'])

In [12]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [13]:
df['new'] = df['W'] + df['X']

In [14]:
df

          W         X         Y         Z       new
a  2.706850  0.628133  0.907969  0.503826  3.334983
b  0.651118 -0.319318 -0.848077  0.605965  0.331800
c -2.018168  0.740122  0.528813 -0.589001 -1.278046
d  0.188695 -0.758872 -0.933237  0.955057 -0.570177
e  0.190794  1.978757  2.605967  0.683509  2.169552

In [16]:
df.drop('new', axis=1, inplace = True)

In [17]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [18]:
df.drop('e')

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [19]:
df

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [20]:
df.shape

(5, 4)

In [27]:
ddf = df['X']

In [28]:
type(ddf)

pandas.core.series.Series

In [29]:
ddf

a    0.628133
b   -0.319318
c    0.740122
d   -0.758872
e    1.978757
Name: X, dtype: float64

In [30]:
df.loc['a']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: a, dtype: float64

In [31]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: a, dtype: float64

In [32]:
df.loc[['a', 'b'], ['W', 'Y']]

          W         Y
a  2.706850  0.907969
b  0.651118 -0.848077

In [33]:
df[df>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [36]:
df[df['W']>0]

          W         X         Y         Z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [39]:
df.reset_index()

  index         W         X         Y         Z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [40]:
newind = 'KD IE OW IE OW'.split()

In [41]:
df['States'] = newind

In [42]:
df

          W         X         Y         Z States
a  2.706850  0.628133  0.907969  0.503826     KD
b  0.651118 -0.319318 -0.848077  0.605965     IE
c -2.018168  0.740122  0.528813 -0.589001     OW
d  0.188695 -0.758872 -0.933237  0.955057     IE
e  0.190794  1.978757  2.605967  0.683509     OW

In [43]:
df.set_index('States')

               W         X         Y         Z
States
KD      2.706850  0.628133  0.907969  0.503826
IE      0.651118 -0.319318 -0.848077  0.605965
OW     -2.018168  0.740122  0.528813 -0.589001
IE      0.188695 -0.758872 -0.933237  0.955057
OW      0.190794  1.978757  2.605967  0.683509

In [44]:
df

          W         X         Y         Z States
a  2.706850  0.628133  0.907969  0.503826     KD
b  0.651118 -0.319318 -0.848077  0.605965     IE
c -2.018168  0.740122  0.528813 -0.589001     OW
d  0.188695 -0.758872 -0.933237  0.955057     IE
e  0.190794  1.978757  2.605967  0.683509     OW

In [50]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index=list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [51]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(np.random.randn(6,2), hier_index, ['A', 'B'])

In [54]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [57]:
df.index.names=(['Group', 'num'])

In [58]:
df

                  A         B
Group num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [60]:
df.loc['G1']

            A         B
num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [61]:
df.xs('G1')

            A         B
num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [65]:
df.xs(1,level='num')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [66]:
d = {'A':[1,3,np.nan],'B':[5,np.nan, np.nan],'C':[1,2,3]}

In [67]:
df = pd.DataFrame(d)

In [68]:
df

     A    B  C
0  1.0  5.0  1
1  3.0  NaN  2
2  NaN  NaN  3

In [69]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [70]:
df.fillna(value=3)

     A    B  C
0  1.0  5.0  1
1  3.0  3.0  2
2  3.0  3.0  3

In [72]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [73]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [74]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [75]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [76]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [86]:
left = pd.DataFrame({
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
'key': ['K0', 'K1', 'K2', 'K3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [87]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [88]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [89]:
pd.merge(left,right,how='inner', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [90]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [91]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [92]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [93]:
df['col2'].nunique()

3

In [94]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [95]:
def times2(s):
    return s**2

df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [96]:
df['col1'].apply(lambda x:x*4)

0     4
1     8
2    12
3    16
Name: col1, dtype: int64

In [99]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [100]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [101]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [105]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [106]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [107]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [108]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [109]:
df.pivot_table(values = 'D', index=['A', 'B'], columns = 'C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN